export default {
  projections: {
    ОтчетОЗакупкахE: {
      номер: {
        __caption__: 'Номер'
      },
      датаНачала: {
        __caption__: 'Дата начала'
      },
      датаОкончания: {
        __caption__: 'Дата окончания'
      },
      организации: {
        __caption__: 'Организации',
        организация: {
          __caption__: 'Организация'
        }
      },
      контрагенты: {
        __caption__: 'Контрагенты',
        контрагент: {
          __caption__: 'Контрагент'
        }
      },
      состояниеОплаты: {
        __caption__: 'Состояние оплаты'
      },
      склады: {
        __caption__: 'Склады',
        склад: {
          __caption__: 'Склад'
        }
      },
      состОтгрузки: {
        __caption__: 'Сост отгрузки'
      },
      суммаВклНДС: {
        __caption__: 'Сумма вкл НДС'
      },
      суммаДокумента: {
        __caption__: 'Сумма документа'
      }
    },
    ОтчетОЗакупкахL: {
      номер: {
        __caption__: 'Номер'
      },
      датаНачала: {
        __caption__: 'Дата начала'
      },
      датаОкончания: {
        __caption__: 'Дата окончания'
      },
      организации: {
        __caption__: 'Организация',
        организация: {
          __caption__: 'Организация'
        }
      },
      склады: {
        __caption__: 'Склад',
        склад: {
          __caption__: 'Склад'
        }
      },
      контрагенты: {
        __caption__: 'Контрагент',
        контрагент: {
          __caption__: 'Контрагент'
        }
      },
      суммаВклНДС: {
        __caption__: 'Сумма вкл НДС'
      },
      суммаДокумента: {
        __caption__: 'Сумма документа'
      },
      состояниеОплаты: {
        __caption__: 'Состояние оплаты'
      },
      состОтгрузки: {
        __caption__: 'Сост отгрузки'
      }
    }
  },
  validations: {
    датаНачала: {
      __caption__: 'Дата начала'
    },
    датаОкончания: {
      __caption__: 'Дата окончания'
    },
    номер: {
      __caption__: 'Номер'
    },
    состОтгрузки: {
      __caption__: 'Сост отгрузки'
    },
    состояниеОплаты: {
      __caption__: 'Состояние оплаты'
    },
    суммаВклНДС: {
      __caption__: 'Сумма вкл НДС'
    },
    суммаДокумента: {
      __caption__: 'Сумма документа'
    },
    контрагенты: {
      __caption__: 'Контрагенты'
    },
    организации: {
      __caption__: 'Организации'
    },
    склады: {
      __caption__: 'Склады'
    },
    тЧЗаказ: {
      __caption__: 'тЧЗаказ'
    },
    тЧОтчет: {
      __caption__: 'тЧОтчет'
    }
  }
};
