export default {
  caption: 'Отчет о закупках',
  'номер-caption': 'Номер',
  'датаНачала-caption': 'Дата начала',
  'датаОкончания-caption': 'Дата окончания',
  'состояниеОплаты-caption': 'Состояние оплаты',
  'состОтгрузки-caption': 'Сост отгрузки',
  'суммаВклНДС-caption': 'Сумма вкл НДС',
  'суммаДокумента-caption': 'Сумма документа',
  'организации.организация-caption': 'Организация',
  'склады.склад-caption': 'Склад',
  'контрагенты.контрагент-caption': 'Контрагент',
  'организации-caption': 'Организации',
  'склады-caption': 'Склады',
  'контрагенты-caption': 'Контрагенты'
};
